performance/taurus.yml
execution:
- concurrency: 2
  throughput: 500
  ramp-up: 5s
  hold-for: 10m
  steps: 1
  scenario: mars-bellatrix

reporting:
- module: final-stats
  summary: false
  percentiles: false
  failed-labels: false
  test-duration: false
  dump-xml: performance_test_result.xml
  dump-csv: performance_test_result.csv
- module: blazemeter
  report-name: mars-bellatrix endpoints
  test: All endpoints
  project: mars-bellatrix

scenarios:
  mars-bellatrix:
    timeout: 5s
    retrieve-resources: false
    store-cache: false
    store-cookie: false
    default-address: http://mars-bellatrix.test.api.bbci.co.uk
    headers:
      Connection: 'Keep-Alive'
    requests:
    - /items